Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: For more details, see Labels.
ja: 詳細は ラベルをご覧ください。

source: For more details, see Script File Codepage.
ja: 詳細はスクリプトファイルのコードページを参照。

source: For more details, see Script Filename.
ja: 詳しくは、「スクリプトのファイル名」をご覧ください。

source: For more details, see OutputDebug.
ja: 詳しくは、OutputDebugをご覧ください。

source: For more details, see the example further below.
ja: 詳しくは、さらに下の例をご覧ください。

source: For more details, see Embedded Scripts.
ja: 詳しくは埋め込みスクリプトをご覧ください。

source: For more details, see the -DPIScale option.
ja: 詳細は-DPIScaleオプションを参照。

source: For more in-depth information and examples, check out the Run page.
ja: より詳細な情報や例については、Runのページをご覧ください。

source: For more in-depth information, check out the #HotIf page.
ja: より詳細な情報については、#HotIfのページをご覧ください。

source: For more information about IfWin, see #HotIf's General Remarks.
ja: IfWinについては、#HotIfの総論をご覧ください。

source: For more information about context-sensitive hotkeys, see #HotIf's General Remarks.
ja: 文脈依存型ホットキーについて詳しくは、#HotIfの総論をご覧ください。

source: For more information about the VKnn method, see Special Keys.
ja: VKnn方式の詳細については、特殊キーを参照してください。

source: For more information on what each one does, read this.
ja: それぞれの役割については、こちらをご覧いただきたい。

source: For more information, read about Continuation Sections.
ja: 詳しくは、継続セクションについてをお読みください。

source: For more information, refer to the FAQ.
ja: 詳しくは、FAQをご覧ください。

source: For more information, see HotIf.
ja: 詳しくは、HotIfをご覧ください。

source: For more information, see Try.
ja: 詳しくは、Tryをご覧ください。

source: For more information, see Remarks.
ja: 詳しくは、「備考」をご覧ください。

source: For more ready-to-run scripts and functions, see AutoHotkey v2 Scripts and Functions Forum.
ja: すぐに実行できるスクリプトや関数については、AutoHotkey v2 Scripts and Functions Forumを参照してください。

source: For more specific details about syntax, see Scripting Language.
ja: 構文の具体的な内容については、「スクリプト言語」をご覧ください。

source: For most hotkeys, the hotkey name consists of optional modifier symbols immediately followed by a single letter or symbol, or a key name.
ja: ほとんどのホットキーでは、ホットキー名は、オプションの修飾記号の直後に1つの文字または記号が続くか、またはキー名で構成されています。

source: For most input-capable controls, the name is also used by Gui.Submit.
ja: ほとんどの入力可能なコントロールの場合、この名前はGui.Submitでも使用されます。

source: For most operators -- such as addition and multiplication -- if either of the inputs is a floating point number, the result will also be a floating point number.
ja: 加算や乗算などのほとんどの演算子では、入力のどちらかが浮動小数点数であれば結果も浮動小数点数になります。

source: For most types of events, new threads are permitted to launch only if the current thread is interruptible.
ja: ほとんどのタイプのイベントでは、現在のスレッドが割り込み可能な場合にのみ、新しいスレッドの起動が許可される。

source: For multi-line controls, Any linefeeds (`n) in NewValue that lack a preceding carriage return (`r) are automatically translated to CR+LF (`r`n) to make them display properly.
ja: 複数行のコントロールの場合、NewValueの改行（`n）のうち、先行するキャリッジリターン（`r）がないものは、自動的にCR+LF（`r`n）に変換され、正しく表示されます。

source: For multi-line controls, any line breaks in the text will be represented as plain linefeeds (`n) rather than the traditional CR+LF (`r`n) used by non-GUI functions such as ControlGetText and ControlSetText.
ja: 複数行のコントロールの場合、テキストの改行は、ControlGetTextや ControlSetTextなどの非GUI関数で使用される従来のCR+LF（`r`n）ではなく、プレーンラインフィード（`n）として表されます。

source: For multi-line hotkeys, use braces to enclose the body of the hotkey instead of terminating it with return (which is implied by the ending brace).
ja: 複数行のホットキーの場合、returnで終了させるのではなく、中括弧を使ってホットキーの本体を囲みます（終了中括弧はこれを意味します）。

source: For multi-select ListBox, Text and Value return an array instead of a pipe-delimited list.
ja: 複数選択可能なListBoxの場合、TextとValueはパイプで区切られたリストではなく、配列で返されます。

source: For non-compiled or embedded scripts:
ja: 非コンパイルまたは埋め込みスクリプトの場合：

source: For non-compiled or embedded scripts: The full path and name of the EXE file that is actually running the current script.
ja: 非コンパイルまたは埋め込みスクリプトの場合：現在のスクリプトを実際に実行しているEXEファイルのフルパスと名前。

source: For now, StrReplace is used, but
ja: 今のところ、StrReplaceが使用されていますが

source: For now, go with the easiest option:
ja: とりあえず、一番簡単な選択肢を選んでください：

source: For now, just know that blocks are used to group multiple lines as a single action or statement (see Control Flow if you want to know more about this).
ja: とりあえず、ブロックは複数の行を1つのアクションやステートメントとしてまとめるために使われるということだけは知っておいてください（このことについて詳しく知りたい方は、「コントロールフロー」を参照してください）。

source: For numeric identifiers, the prefix "CP" can be omitted only if Length is specified.
ja: 数値識別子では、Lengthが指定されている場合のみ、接頭辞 "CP"を省略することができる。

source: For numeric strings, there are fewer cases where whitespace characters other than space and tab are allowed to precede the number.
ja: 数値文字列の場合、数字の前にスペースとタブ以外の空白文字が許されるケースは少なくなっています。

source: For operating upon everything on the clipboard (such as pictures and formatting).
ja: クリップボード上のすべてのもの（画像や書式など）を操作するためのものです。

source: For optimal learning power, it is advised that you read the text and try the code.
ja: 最適な学習力を得るためには、テキストを読み、コードを試すことをお勧めする。

source: For other control types, R is the number of rows of text that can visibly fit inside the control.
ja: その他のコントロールタイプの場合、Rはコントロール内に視覚的に収まるテキストの行数です。

source: For other controls, CurrentText is empty/blank.
ja: その他のコントロールの場合、CurrentTextは、空/空白となります。

source: For other controls, RetrievedText is empty/blank.
ja: その他のコントロールの場合、RetrievedTextは、空/空白となります。

source: For other extended styles not documented here (since they are rarely used), see Extended Window Styles | Microsoft Docs for a complete list.
ja: ここに書かれていない他の拡張スタイル（ほとんど使用されないため）については、「拡張ウィンドウスタイル｜Microsoft Docs」を参照し、完全なリストを入手してください。

source: For other menus, &Open has no effect if A_AllowMainWindow is 0.
ja: その他のメニューでは、A_AllowMainWindowが 0 の場合、&Openの効果はありません。

source: For other options, see row options.
ja: その他のオプションについては、「行のオプション」を参照してください。

source: For performance reasons, changes to a control's content generally do not cause the control to be immediately redrawn even if redraw is enabled.
ja: パフォーマンス上の理由から、一般に、コントロールの内容を変更しても、再描画が有効であっても、コントロールが直ちに再描画されることはありません。

source: For performance reasons, freeing a variable whose previous capacity was less than 64 characters might have no effect because its memory is of a permanent type.
ja: 性能上の理由から、以前の容量が64文字未満の変数を解放しても、そのメモリは永久型であるため、何の効果もないかもしれない。

source: For performance reasons, it is better to set all options in a single line, and to do so before creating the window (that is, before any use of other methods such as Gui.Add).
ja: パフォーマンス上の理由から、すべてのオプションを1行で設定し、ウィンドウを作成する前に（つまり、Gui.Addなどの他のメソッドを使用する前に）設定することをお勧めします。

source: For performance reasons, the memory of a variable whose capacity is less than 4096 bytes is not freed by storing an empty string in it (e.g. Var := "").
ja: パフォーマンス上の理由から、容量が4096バイト未満の変数に空文字列を格納してもメモリは解放されない（例：Var := ""）。

source: For performance, \d, \D, \s, \S, \w, \W, \b and \B recognize only ASCII characters by default.
ja: 性能上、\d、\D、\s、\S、\w、\W、\b および \Bは、デフォルトではASCII文字としてしか認識しません。

source: For possible solutions, see further below.
ja: 解決策については、さらに以下をご覧ください。

source: For posting to hidden windows add this to script:
ja: 非表示のウィンドウに投稿するには、スクリプトに以下を追加する：

source: For posting to hidden windows add this to script: DetectHiddenWindows True
ja: 非表示のウィンドウに投稿するには、スクリプトに以下を追加する：DetectHiddenWindows True

source: For practical reasons, the length of a string and positions within a string are measured by counting these fixed-size units, even though they may not be complete Unicode characters.
ja: 実用的な理由から、文字列の長さや文字列内の位置は、完全なUnicode文字でなくても、これらの固定サイズのユニットをカウントして測定されます。

source: For recommendations, try Editors with AutoHotkey Support or the Editors subforum.
ja: おすすめは、AutoHotkeyサポートの編集者または編集者サブフォーラムを試してみてください。

source: For remote registry access, this value will not include the computer name.
ja: リモートレジストリアクセスの場合、この値にはコンピュータ名は含まれません。

source: For resources other than *#1, the resource specifier is included in the main window's title to support #SingleInstance and Reload.
ja: *#1以外のリソースについては、#SingleInstanceと Reloadをサポートするために、リソース指定子がメインウィンドウのタイトルに含まれる。

source: For right-clicks, Item contains the clicked item's ID or row number (or 0 if the user clicked somewhere other than an item).
ja: 右クリックの場合、Itemにはクリックされた項目のIDまたは行番号（項目以外の場所をクリックした場合は0）が入ります。

source: For simple scripts, see Debugging a Script.
ja: 簡単なスクリプトについては、「スクリプトのデバッグ」を参照してください。

source: For size and offset calculations, use A_PtrSize.
ja: サイズとオフセットの計算には、A_PtrSizeを使用します。

source: For software which is copyrighted by the Free Software Foundation, write to the Free Software Foundation; we sometimes make exceptions for this.
ja: フリーソフトウェアファウンデーションによって著作権が保護されているソフトウェアについては、フリーソフトウェアファウンデーションに連絡してください。

source: For some loop types, other built-in variables return information about the current loop item (registry key/value, file, substring or line of text).
ja: 一部のループタイプでは、他の組み込み変数が現在のループアイテム（レジストリキー/値、ファイル、部分文字列、テキスト行）に関する情報を返します。

source: For sorting purposes, indicates that this column contains floating point numbers (hexadecimal format is not supported).
ja: 並べ替えのために、このカラムが浮動小数点数を含むことを示します（16進数形式はサポートされていません）。

source: For sorting purposes, indicates that this column contains integers.
ja: 並べ替えのために、このカラムが整数を含むことを示します。

source: For such cases, call StrPut with two parameters to calculate the required size.
ja: このような場合は、StrPutに2つのパラメータを付けて呼び出し、必要なサイズを計算する。

source: For tab controls, you should note that a tab's sub-controls stay associated with their original tab number; that is, they are never associated with their tab's actual display-name.
ja: タブコントロールの場合、タブのサブコントロールは元のタブ番号に関連付けられ、タブの実際の表示名には関連付けられないことに注意する必要があります。

source: For text controls, if the control contains a single line of text, the text is centered vertically within the available height of the control.
ja: テキストコントロールの場合、コントロールが1行のテキストを含む場合、テキストはコントロールの利用可能な高さの範囲内で垂直方向にセンタリングされる。

source: For the AppsKey and Shift-F10, Item contains the selected item's ID or row number.
ja: AppsKeyとShift-F10の場合、Itemには選択された項目のIDまたは行番号が入ります。

source: For the WshShell object, see Microsoft Docs.
ja: WshShellオブジェクトについては、Microsoft Docsを参照してください。

source: For the advantages and disadvantages of each approach, see registry remapping.
ja: 各アプローチの利点と欠点については、レジストリの再マッピングを参照のこと。

source: For the example above, the address is valid until SendMessage returns.
ja: 上の例では、アドレスはSendMessageが戻るまで有効である。

source: For the examples above and below which use ahk_group AltTabWindow, this window group is expected to be defined during script startup.
ja: ahk_group AltTabWindowを使用する上下の例では、スクリプト起動時にこのウィンドウグループが定義されていることが期待されます。

source: For the first case, you can simply call Send, then Sleep, then Send, and so on.
ja: 最初の場合は、「Send」→「Sleep」→「Send」と呼び出すだけでよいです。

source: For the first character, n should have the value 1.
ja: 最初の文字については、nは値1でなければならない。

source: For the integer types (d, i, u, x, X, o), Precision acts like Width with the 0 prefix and a default of 1.
ja: 整数型（d、i、u、x、X、o）の場合、Precisionは Widthのように接頭辞0、デフォルト1として動作します。

source: For the next example I'm taking Paint because possibly everyone will have that.
ja: 次の例ではペイントを取り上げる。

source: For the other control types, the height is calculated automatically based on their contents.
ja: その他のコントロールタイプについては、その内容に基づいて高さが自動的に計算されます。

source: For the second time, it contains 2; and so on.
ja: 2回目には2が入り、以下同様です。

source: For the timeout, specifying 0 is no longer the same as specifying 0.5; instead, it produces the shortest wait possible.
ja: タイムアウトについては、0を指定しても0.5を指定したのと同じではなく、可能な限り短い待ち時間を生成するようになりました。

source: For them, use a Loop such as the following:
ja: それらには、以下のようなLoopを使用します：

source: For them, use the Click function multiple times by means such as Loop.
ja: それらのために、Loopなどの手段でClick機能を複数回使用します。

source: For these reasons, it is generally recommended to use an Array or Map instead of a pseudo-array:
ja: これらの理由から、一般的には擬似配列ではなく、Arrayや Mapを使用することが推奨されます：

source: For this function to work, the target window need not be active.
ja: この機能を使用するためには、ターゲットウィンドウがアクティブである必要はありません。

source: For this guide we will use the Installer since it is easiest to set up.
ja: このガイドでは、セットアップが最も簡単なインストーラーを使用します。

source: For this reason, renaming or removing a tab will not change the tab number to which the sub-controls belong.
ja: このため、タブの名前を変更したり削除しても、サブコントロールが属するタブ番号は変更されません。

source: For this variable to be of use, the keyboard or mouse hook must be installed and key history must be enabled.
ja: この変数を使用するには、キーボードまたはマウスフックがインストールされ、キーヒストリーが有効になっていなければならない。

source: For those applications, use a Loop to turn the wheel more than one notch as in this example, which turns it 5 notches:
ja: そのような場合は、この例のようにLoopを使ってホイールを1ノッチ以上回し、5ノッチ分回してください。

source: For those applications, use a loop to turn the wheel more than one notch as in this example, which turns it 5 notches:
ja: そのような場合は、この例のようにLoopを使ってホイールを1ノッチ以上回し、5ノッチ分回してください：

source: For those details, refer to the v1.1 documentation.
ja: これらの詳細については、v1.1のドキュメントを参照してください。

source: For those new to programming, the requirement for parentheses may seem cryptic or verbose at first, but they are what allows a function call to be combined with other operations.
ja: プログラミングの初心者にとって、括弧の必要性は、最初は不可解で冗長に見えるかもしれませんが、括弧は、関数呼び出しが他の操作と組み合わされることを可能にするものなのです。

source: For use with Gui.SetFont.
ja: Gui.SetFontで使います。

source: For v2, the path, version and build of AutoHotkey are always shown in the error message.
ja: v2の場合、エラーメッセージにAutoHotkeyのパス、バージョン、ビルドが必ず表示されます。

source: For v2.0, A_LastError is also set by IniRead, IniWrite and IniDelete.
ja: v2.0では、A_LastErrorはIniRead、IniWrite、IniDeleteでも設定されます。

source: For variables that are not function parameters, a VarUnset warning may still be shown at load-time if there are other references to the variable but no assignments.
ja: 関数のパラメータではない変数の場合、変数への参照はあるが代入がない場合、ロード時にVarUnset 警告が表示されることがあります。

source: For-loop
ja: Forループ

source: For-loop usage is for val in arr or for idx, val in arr, where idx = A_Index by default.
ja: Forループの使用法は、for val in arrまたはfor idx, val in arrで、デフォルトではidx = A_Indexです。

source: Forces ScrollLock to stay off permanently.
ja: ScrollLockを強制的に永久にOFFにします。

source: Forces all matching processes to close.
ja: マッチしたプロセスを全て閉じます。

source: Forces Notepad to close (be warned that any unsaved data will be lost).
ja: メモ帳を強制終了します（保存していないデータは失われますのでご注意ください）。

source: Forces a reboot (reboot + force = 2 + 4 = 6).
ja: 警告せずに再起動します（再起動 + 警告せずに閉じる = 2 + 4 = 6）。

source: Forces dollar-sign ($) to match at the very end of Haystack, even if Haystack's last item is a newline.
ja: Haystackの最後の項目が改行であっても、ドル記号（$）を強制的にHaystackの最後にマッチさせる。

source: Forces the first matching process to close (be warned that any unsaved data will be lost).
ja: 最初にマッチしたプロセスを、保存されていないデータは失われることを警告してから閉じます。

source: Forces the first matching process to close.
ja: 最初にマッチングしたプロセスを強制的に終了させます。

source: Forces the key to stay off permanently.
ja: 強制的にキーが永久に外れないようにします。

source: Forces the key to stay on permanently.
ja: キーを強制的に常時点灯させる。

source: Forces the pattern to be anchored; that is, it can match only at the start of Haystack.
ja: つまり、Haystackの先頭でのみマッチする。

source: Forces the script to use the folder it was initially launched from as its working directory.
ja: スクリプトが最初に起動したフォルダを作業ディレクトリとして使用するように強制します。

source: Forces the specified window to close.
ja: 指定したウィンドウを強制的に閉じます。

source: Forces the use of the hook to implement all or some keyboard hotkeys.
ja: フックを使用して、すべてまたは一部のキーボードホットキーを実装することを強制します。

source: Forces windowing functions to operate upon windows whose titles contain WinTitle at the beginning instead of anywhere.
ja: ウィンドウ関数は、タイトルの先頭にWinTitleを含むウィンドウを操作する。

source: Format - Syntax & Usage | AutoHotkey v2
ja: Format - 構文と使用法｜AutoHotkey v2

source: Format Specifiers
ja: フォーマット指定子

source: FormatTime - Syntax & Usage | AutoHotkey v2
ja: FormatTime - 構文と使用法｜AutoHotkey v2

source: Formats a variable number of input values according to a format string.
ja: 可変数の入力値を、フォーマット文字列に従って整形します。

source: Formatting/tidying code
ja: コードのフォーマット／整頓

source: Formula
ja: フォーミュラ

source: Forward
ja: 進む

source: Forward slashes (/) are not supported.
ja: フォワードスラッシュ（/）はサポートされていません。

source: Free keyboard remapper that can also remap mouse and controller buttons.
ja: マウスやコントローラーのボタンもリマップできる無料のキーボードリマッパー。

source: Free variables are local variables of the outer function which are also used by nested functions.
ja: 自由変数は、外側の関数のローカル変数で、ネストした関数でも使用されます。

source: Freeing Objects
ja: オブジェクトの解放

source: Freeing the value requires knowing which type it is.
ja: 値を解放するには、その値がどのタイプであるかを知る必要があります。

source: Frees a callback created by CallbackCreate.
ja: CallbackCreate で作成されたコールバックを解放します。

source: Frequently Asked Questions (FAQ)
ja: よくある質問（FAQ）

source: Frequently Asked Questions (FAQ) | AutoHotkey v2
ja: よくある質問（FAQ）｜AutoHotkey v2

source: Frequently asked questions
ja: よくある質問

source: From the function's point of view, parameters are essentially the same as local variables unless they are marked as ByRef as in this example:
ja: 関数から見ると、パラメータは、この例のようにByRefとしてマークされていない限り、基本的にローカル変数と同じです：

source: From the menu bar, select Configure > Preferences.
ja: メニューバーから、「設定」→「環境設定」を選択します。

source: From the menu bar, select Tools > Configure User Tools.
ja: メニューバーから、「ツール」→「ユーザーツールの設定」を選択します。

source: Fuchsia
ja: Fuchsia（フクシア）

source: Full month name (e.g. January) in the current user's language
ja: 現在のユーザーの言語での完全な月名（例：1月）

source: Full name for the day of the week (e.g. Monday) in the current user's language
ja: 現在のユーザーの言語での曜日（例：月曜日）を表すフルネーム

source: Func (use a direct reference like MyFunc)
ja: Func（MyFuncのように直接参照を使用します）

source: Func Object
ja: Funcオブジェクト

source: Func Object - Methods & Properties | AutoHotkey v2
ja: Funcオブジェクト - メソッドとプロパティ｜AutoHotkey v2

source: Function Call Statements
ja: 関数呼び出し文

source: Function Calls
ja: 関数呼び出し

source: Function Calls with or without Parentheses
ja: 括弧の有無による関数呼び出し

source: Function Keys
ja: ファンクションキー

source: Function Objects
ja: 機能オブジェクト

source: Function Objects - Definition & Usage | AutoHotkey v2
ja: 関数オブジェクト - 定義と使用法｜AutoHotkey v2

source: Function Parameter1, Parameter2, Parameter3 ; without parentheses
ja: Function Parameter1, Parameter2, Parameter3 ; 括弧なし

source: Function and variable names are now placed in a shared namespace.
ja: 関数名と変数名が共有名前空間に配置されるようになりました。

source: Function call statements cannot be variadic, although they can pass a fixed number of parameters to a variadic function.
ja: 関数呼び出し文は、可変関数に固定数のパラメータを渡すことができますが、可変関数にすることはできません。

source: Function call statements have the following limitations:
ja: 関数呼び出し文には、以下の制限があります：

source: Function calls now permit virtually any sub-expression for specifying which function to call, provided that there is no space or tab before the open-parenthesis of the parameter list.
ja: 関数呼び出しでは、パラメータリストの開括弧の前にスペースやタブがなければ、どの関数を呼び出すかを指定するために、事実上どんな下位式でも使用できるようになりました。

source: Function calls such as MyFunc(Params).
ja: MyFunc(Params)のような関数呼び出し。

source: Function keys.
ja: ファンクションキー。

source: Function objects are either references to Func objects representing actual functions, or objects which can be called like functions.
ja: 関数オブジェクトは、実際の関数を表すFuncオブジェクトへの参照か、関数のように呼び出すことができるオブジェクトです。

source: Function objects can be used with the following:
ja: ファンクション・オブジェクトは以下のように使用できる：

source: Function objects should implement a Call method instead of __Call, which is only for explicit method calls.
ja: 関数オブジェクトは、明示的なメソッド呼び出しにのみ使用される__Callの代わりに、Callメソッドを実装する必要があります。

source: Function(Parameter1, Parameter2, Parameter3) ; with parentheses
ja: Function(Parameter1, Parameter2, Parameter3) ; 括弧あり

source: Function1(&Param) ; ByRef parameter.
ja: Function1(&Param) ; ByRefパラメータ

source: Functions
ja: 関数

source: Functions - Definition & Usage | AutoHotkey v2
ja: 関数 - 定義と使用法｜AutoHotkey v2

source: Functions return a value, so the result of the function is often called a return value.
ja: 関数は値を返すので、関数の結果を返り値と呼ぶことが多い。

source: Functions and expressions that accept numeric inputs generally support 15 digits of precision for floating point values.
ja: 数値入力を受け付ける関数や式は、通常、浮動小数点値に対して15桁の精度をサポートしている。

source: Functions are assume-local by default, and this is true even for nested functions, even those inside an assume-static function.
ja: 関数はデフォルトでassume-localであり、これはネストされた関数、assume-static関数の内部であっても同様です。

source: Functions are assume-local by default.
ja: ファンクションはデフォルトでassume-localです。

source: Functions can be placed in the auto-execute section without interrupting it.
ja: 関数を自動実行部に割り込ませることなく配置することができます。

source: Functions can be used everywhere that label subroutines were used before (even inside other functions).
ja: 関数は、これまでラベルサブルーチンが使われていた場所ならどこでも（他の関数の中でも）使うことができます。

source: Functions can have many different purposes.
ja: 機能にはさまざまな目的があります。

source: Functions can no longer be dynamically called with more parameters than they formally accept.
ja: 関数が正式に受け付ける以上のパラメータで動的に呼び出すことができなくなりました。

source: Functions can now read global variables without declaring them.
ja: 関数は、グローバル変数を宣言せずに読み込めるようになりました。

source: Functions cannot overlap (but can be contained within a function).
ja: 機能は重複できません（ただし、機能内に含めることはできます）。

source: Functions for checking the type and other conditions of a given value.
ja: 与えられた値の型やその他の条件をチェックするための関数です。

source: Functions for performing the following operations on a process:
ja: プロセスに対して、以下の操作を行うための機能：

source: Functions for performing various mathematical operations such as rounding, exponentiation, squaring, etc.
ja: 四捨五入、指数、二乗など、さまざまな数学的処理を行うための関数です。

source: Functions for retrieving information about one or more windows or for performing various operations on a window.
ja: ウィンドウに関する情報を取得したり、ウィンドウに対してさまざまな操作を実行したりするための関数です。

source: Functions for retrieving information about the computer's drive(s) or for performing various operations on a drive.
ja: コンピュータのドライブに関する情報を取得したり、ドライブに対してさまざまな操作を実行したりするための関数です。

source: Functions for retrieving screen resolution and multi-monitor info.
ja: 画面解像度やマルチモニター情報を取得する関数。

source: Functions for retrieving various types of information about the computer's drive(s), or making a variety of changes to a drive.
ja: コンピュータのドライブに関するさまざまな情報を取得したり、ドライブにさまざまな変更を加えたりするための機能です。

source: Functions generally throw an exception on failure.
ja: 関数は一般に、失敗すると例外を投げます。

source: Functions may also store results in variables, such as when there is more than one result (see Returning Values).
ja: 関数は、結果が複数ある場合など、結果を変数に格納することもあります（「値を返す」を参照）。

source: Functions might be a little less prone to being misused as "goto" (where a user gosubs the current subroutine in order to loop, inevitably exhausting stack space and terminating the program).
ja: 関数は、「goto」（ユーザーがループするために現在のサブルーチンをgosubすることで、必然的にスタックスペースを使い果たしてプログラムを終了させること）として悪用される可能性が少し低くなるかもしれません。

source: Functions never default to the target window's topmost control.
ja: 関数のデフォルトがターゲットウィンドウの最上位コントロールになることはありません。

source: Functions no longer support the nameless method.
ja: 関数がnamelessメソッドに対応しなくなりました。

source: Functions provided by the operating system generally limit paths to 259 characters, with some exceptions.
ja: オペレーティング・システムが提供する関数は、いくつかの例外を除き、通常パスを259文字に制限している。

source: Functions should be called or handled by reference, not by name.
ja: 関数は、名前ではなく、参照によって呼び出したり、扱ったりする必要があります。

source: Functions that accept the address of a structure (or a memory-block array) can be called by allocating memory by some means and passing the memory address to the function.
ja: 構造体（またはメモリブロック配列）のアドレスを受け取る関数は、何らかの方法でメモリを確保し、そのメモリアドレスを関数に渡すことで呼び出すことができます。

source: Functions to retrieve information about a control, or make a variety of changes to a control.
ja: コントロールに関する情報を取得したり、コントロールに様々な変更を加えるための機能。

source: Functions to retrieve information about one or more windows, or make a variety of changes to a window.
ja: 1つまたは複数のウィンドウに関する情報を取得したり、ウィンドウにさまざまな変更を加えたりする機能。

source: Functions usually expect parameters to be written in a specific order, so the meaning of each parameter value depends on its position in the comma-delimited list of parameters.
ja: 関数は通常、パラメータを特定の順序で記述することを想定しているため、各パラメータ値の意味は、カンマで区切られたパラメータリスト内の位置に依存します。
